app/controllers/episodes_controller.rb

SELECT "shows".* FROM "shows" WHERE "shows"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        # fetch(`http://localhost:3000/episodes/${show.id}`)

        current_show=Show.find(params[:id])