app/controllers/episodes_controller.rb

    def show
        # fetch(`http://localhost:3000/episodes/${object.show.id}`)
        show_api_id=params[:id]
        current_show=Show.find_by(api_id: show_api_id)
---
SELECT "shows".* FROM "shows" WHERE "shows"."api_id" = $1 LIMIT $2  [["api_id", 526], ["LIMIT", 1]]