app/controllers/users_controller.rb

      def create
        # {
        #     "username": "sara",
        #     "location": "seattle"
        # }
        user=User.create(user_params)
        user.update(score: 0)
---
INSERT INTO "users" ("username", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "tv watcher7"], ["location", "dsgdf"], ["created_at", "2020-05-05 18:50:01.457464"], ["updated_at", "2020-05-05 18:50:01.457464"]]
UPDATE "users" SET "score" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["score", 0], ["updated_at", "2020-05-05 18:50:01.479523"], ["id", 6]]