app/controllers/user_shows_controller.rb

      def create
        # {
        #     "user_id": 1,
        #     "api_id": 5,
        #     "title": "Under the Dome"
        # }

        sentshow= Show.find_by(api_id: params["api_id"].to_i)
        user=User.find(params["user_id"].to_i)
        if sentshow
          if user.shows.include?(sentshow)
            user_show=UserShow.find_by(user_id: params["user_id"].to_i, show_id: sentshow.id)
          else
            user_show=UserShow.create(user_id: params["user_id"].to_i, show_id: sentshow.id)
          end
        else
           newshow= Show.create(title: params["title"], api_id: params["api_id"].to_i)
           newshow.populate
           user_show=UserShow.create(user_id: params["user_id"].to_i ,show_id: newshow.id)
---
SELECT "shows".* FROM "shows" WHERE "shows"."api_id" = $1 LIMIT $2  [["api_id", 30992], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "shows" INNER JOIN "user_shows" ON "shows"."id" = "user_shows"."show_id" WHERE "user_shows"."user_id" = $1 AND "shows"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 1], ["LIMIT", 1]]
SELECT "user_shows".* FROM "user_shows" WHERE "user_shows"."user_id" = $1 AND "user_shows"."show_id" = $2 LIMIT $3  [["user_id", 1], ["show_id", 6], ["LIMIT", 1]]
SELECT "user_shows".* FROM "user_shows" WHERE "user_shows"."user_id" = $1 AND "user_shows"."show_id" = $2 LIMIT $3  [["user_id", 1], ["show_id", 3], ["LIMIT", 1]]
INSERT INTO "users" ("username", "location", "score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "Sara"], ["location", "Seattle"], ["score", 0], ["created_at", "2020-05-05 04:48:54.561843"], ["updated_at", "2020-05-05 04:48:54.561843"]]
INSERT INTO "user_shows" ("show_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["show_id", 3], ["user_id", 1], ["created_at", "2020-05-03 00:42:22.513388"], ["updated_at", "2020-05-03 00:42:22.513388"]]
INSERT INTO "shows" ("title", "api_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Under the Dome"], ["api_id", 2], ["created_at", "2020-05-03 00:41:19.612222"], ["updated_at", "2020-05-03 00:41:19.612222"]]
INSERT INTO "user_shows" ("show_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["show_id", 5], ["user_id", 1], ["created_at", "2020-05-03 00:49:25.809279"], ["updated_at", "2020-05-03 00:49:25.809279"]]

      def destroy
        user_show = UserShow.find(params[:id])
        user_show.destroy
---
SELECT "user_shows".* FROM "user_shows" WHERE "user_shows"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "user_shows" WHERE "user_shows"."id" = $1  [["id", 8]]