app/models/show.rb

    def populate
        res = RestClient.get("http://api.tvmaze.com/shows/#{self.api_id}/episodes")
        episodes = JSON.parse(res.body)
            #make episodes
        episodes.each do |episode|
           Episode.create(show_id: self.id, season: episode["season"], number: episode["number"], name:episode["name"])
---
INSERT INTO "episodes" ("show_id", "season", "number", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["show_id", 3], ["season", 1], ["number", 1], ["name", "Pilot"], ["created_at", "2020-05-03 04:52:03.889651"], ["updated_at", "2020-05-03 04:52:03.889651"]]